getApp();

Page({
    data: {
        table1: {
            header: [ "排名", "奖励占比", "最大值（元）" ],
            content: [ {
                col1: 1,
                col2: "10.00%",
                col3: 3e3
            }, {
                col1: 2,
                col2: "8.00%",
                col3: 2400
            }, {
                col1: 3,
                col2: "7.50%",
                col3: 2250
            }, {
                col1: 4,
                col2: "6.00%",
                col3: 1800
            }, {
                col1: 5,
                col2: "5.00%",
                col3: 1500
            }, {
                col1: 6,
                col2: "4.00%",
                col3: 1200
            }, {
                col1: 7,
                col2: "3.50%",
                col3: 1050
            }, {
                col1: 8,
                col2: "3.00%",
                col3: 900
            }, {
                col1: 9,
                col2: "2.50%",
                col3: 750
            }, {
                col1: 10,
                col2: "2.00%",
                col3: 600
            }, {
                col1: "11~15",
                col2: "1.40%",
                col3: 420
            }, {
                col1: "16~20",
                col2: "1.20%",
                col3: 360
            }, {
                col1: "21~25",
                col2: "1.00%",
                col3: 300
            }, {
                col1: "26~30",
                col2: "0.70%",
                col3: 210
            }, {
                col1: "31~35",
                col2: "0.50%",
                col3: 150
            }, {
                col1: "36~40",
                col2: "0.40%",
                col3: 120
            }, {
                col1: "41~50",
                col2: "0.25%",
                col3: 75
            } ]
        },
        table2: {
            header: [ "排名", "奖励" ],
            content: [ {
                col1: "51～10%",
                col2: "瓜分6%的奖池"
            }, {
                col1: "10%～20%",
                col2: "瓜分5%的奖池"
            }, {
                col1: "20%～30%",
                col2: "瓜分4%的奖池"
            }, {
                col1: "30%～40%",
                col2: "瓜分3%的奖池"
            }, {
                col1: "40%～50%",
                col2: "瓜分2%的奖池"
            } ]
        }
    }
});